{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.5/4.0"
      ],
      "degree": "Bachelor of Technology",
      "department": "U \u0026 P U Patel Department of Computer Engineering",
      "duration": "2018-2022",
      "school_name": "Charotar University of Science and Technology"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_SiddharthJoshi",
  "highlighted_projects": [
    {
      "description": "This Project Prototype is designed for people who want real time updates of price drop in flight tickets. This Project sends real time alerts via email whenever flights prices are low.",
      "git_url": "https://github.com/Clandoor/CheapFlightFinder",
      "name": "Cheap Flight Finder"
    },
    {
      "description": "A full stack application for the university hospital utilizing HTML, CSS, Bootstrap, JavaScript, MySQL and PHP. Enhanced the older donor management system of the hospital by equipping the blood donation department with the latest cutting-edge technologies.",
      "name": "Blood Bank Data Management System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "A Monitoring Agent intended for the Jarvis Linux Cluster Administrator Team (LCA). This project gathers the real-time data from all the available machines such as hardware specifications (CPU, Memory, etc.). This data is persisted in a relational database providing accurate records of data at a particular timestamp. This data will be used by the LCA team to manage resources. This project can be deployed across multiple host machines to enable real time data gathering. The technologies used for this project are Postgres Database, Docker, Git, GitHub and Linux.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Siddharth Joshi",
  "others": [
    {
      "bullets": [
        "Getting Started with Cloud for the Enterprise",
        "Getting Started with Enterprise Data Science"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Swimming",
        "Hiking",
        "Volunteer, Charusat University: Volunteered for providing basic necessities to people in rural areas."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Leveraged multiple cutting-edge technologies to build multiple projects spanning in various fields of software.",
      "duration": "Nov 2023 - Present",
      "title": "Software Engineer"
    },
    {
      "company": "ABXR Engine",
      "description": "Designed and Implemented RESTful APIs for AI-based text-to-voice generation, enabling the users to choose from a variety of celebrity voices resulting in enhanced user experience and engagement.",
      "duration": "Aug 2023 - Dec 2023",
      "title": "Software Engineer"
    }
  ],
  "skills": {
    "competent": [
      "JavaScript",
      "C/C++",
      "Django",
      "Flask",
      "Godot Game Engine"
    ],
    "familiar": [
      "C#",
      ".NET Framework",
      "Amazon Web Services",
      "NoSQL",
      "Docker"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Python"
    ]
  },
  "summary": "Heya! I am Siddharth Joshi. I am a Software Engineer with Bachelors of Technology in Computer Engineering. I have a passion for software engineering as I believe technology has revolutionized the entire world by coming up with meaningful solutions and delivering values. Breaking down problems is something I enjoy. This is the exact thing which motivates me and exictes me is that I get to craft solutions to real world problems collaborating with other like-minded individuals towards the same goal. I have worked with wide array of technologies from Java and Spring Boot to Python and Django along with Data Engineering. I am confident I can bring values along with my technical acumen to your organization."
}
